EDT/УТ/src/Reports/ЭкономикаЗаказов/ЭкономикаЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЭкономикаЗаказов</name>
</mdclass:Report>

EDT/УТ/src/Documents/экЗакрытиеМесяца/экЗакрытиеМесяца.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>экЗакрытиеМесяца</name>
  <registerRecords>AccumulationRegister.экЗатратыПоЗаказам</registerRecords>
  <attributes>
    <name>ПериодРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияЗатратЗП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияЗатратСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗП_СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.экСтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад_СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.экСтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад_СуммаКРаспределению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад_КоличествоОпераций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад_ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад_СтоимостьОбработкиЕдиницыВеса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад_СуммаЗатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад_УчетныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад_СтоимостьСкладскойОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магистраль_СуммаЗатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магистраль_УчетныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магистраль_СтоимостьОбработки_кг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентЗатратНаОперацииТерминал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗатратыАвто</name>
    <attributes>
      <name>ФорматАвтотранспорта</name>
      <type>
        <types>CatalogRef.ФорматыАвтотранспорта</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРейсов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗатрат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьРейса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Catalogs/РегиональныеТерминалы/РегиональныеТерминалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РегиональныеТерминалы</name>
  <predefined>
    <items>
      <name>МоскваСтриж</name>
      <description>Москва Стриж</description>
    </items>
    <items>
      <name>СПбСтриж</name>
      <description>СПб Стриж</description>
    </items>
  </predefined>
  <attributes>
    <name>КодТерминала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Самовывоз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДнейОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДнейДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическаяЗонаДоставки</name>
    <type>
      <types>CatalogRef.новаРайоны</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьСМС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗакрытияОперДня</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеглЗаданиеЗакрытиеОперДня</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>vr_АдресБоевогоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_БоевойСерверИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_БоевойСерверПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_АдресТестовогоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_ТестовыйСерверИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_ТестовыйСерверПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяШиротаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяДолготаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяШиротаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяДолготаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ксИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ксПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ксАдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_АккаунтБоевогоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_АккаунтТестовогоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_ИдРаспредЦентраБоевогоСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_ИдРаспредЦентраТестовогоСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефонаСтаршегоЛогиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимПечатиЧековРМЭкипажа</name>
    <type>
      <types>EnumRef.ВариантыПечатиЧековРМЭкипажа</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверККМ</name>
    <type>
      <types>ExchangePlanRef.ОбменСКассовымСервером</types>
    </type>
  </attributes>
  <attributes>
    <name>vr_ОсновнойРаспределительныйЦентр</name>
    <type>
      <types>CatalogRef.РаспределительныеЦентрыVeeroute</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиротаЦентраЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолготаЦентраЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоИнтервалаДоставкиВОбласти</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеИнтервалаДоставкиВОбласти</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/ФорматыАвтотранспорта/ФорматыАвтотранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФорматыАвтотранспорта</name>
  <predefined>
    <items>
      <name>БольшоеАвто</name>
      <description>Большое авто</description>
    </items>
    <items>
      <name>ЗаборноеАвто</name>
      <description>Заборное авто</description>
    </items>
    <items>
      <name>МалоеАвто</name>
      <description>Малое авто</description>
    </items>
  </predefined>
</mdclass:Catalog>

EDT/УТ/src/Reports/ЭкономикаЗаказов/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
    СтандартнаяОбработка = Ложь;
	
	НастройкиКомпоновщика = КомпоновщикНастроек.ПолучитьНастройки();
	
	ЭлементыПараметров = НастройкиКомпоновщика.ПараметрыДанных.Элементы;
	
	СтандартныйПериод = ЭлементыПараметров.Найти("Период").Значение;

	Если ЗначениеЗаполнено(СтандартныйПериод) И ЗначениеЗаполнено(СтандартныйПериод.ДатаНачала) И ЗначениеЗаполнено(СтандартныйПериод.ДатаОкончания)Тогда
		
	Иначе
		ВызватьИсключение "Не заполнены обязательные параметры отчета";
	КонецЕсли;
	
	ТекПараметр = ЭлементыПараметров.Найти("НачалоПериода");
	ТекПараметр.Значение = СтандартныйПериод.ДатаНачала;
	ТекПараметр.Использование = Истина;
	
	ТекПараметр = ЭлементыПараметров.Найти("ОкончаниеПериода");
	ТекПараметр.Значение = СтандартныйПериод.ДатаОкончания;
	ТекПараметр.Использование = Истина;
	
	ТекПараметр = ЭлементыПараметров.Найти("ТипФормированияОтчета");
	ТекПараметр.Значение = "НЕЗАКРЫТЫЙ ПЕРИОД";
	ТекПараметр.Использование = Истина;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПериодРасчета", НачалоДня(КонецМесяца(СтандартныйПериод.ДатаОкончания)));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ВЗ_ЗакрытиеМесяца.ЗакрытиеМСК.Склад_СтоимостьСкладскойОперации, 0) КАК СтоимостьСкладскойОперацииМСК,
	|	ЕСТЬNULL(ВЗ_ЗакрытиеМесяца.ЗакрытиеСПБ.Склад_СтоимостьСкладскойОперации, 0) КАК СтоимостьСкладскойОперацииСПБ,
	|	ЕСТЬNULL(ЕСТЬNULL(ВЗ_ЗакрытиеМесяца.ЗакрытиеМСК.Магистраль_СтоимостьОбработки_кг, ВЗ_ЗакрытиеМесяца.ЗакрытиеСПБ.Магистраль_СтоимостьОбработки_кг), 0) КАК СтоимостьОбработки1кгМагистрали,
	|	ЕСТЬNULL(экЗакрытиеМесяцаЗатратыАвто_МСКМ.СтоимостьРейса, 0) КАК СтоимостьРейсаРМММСК,
	|	ЕСТЬNULL(экЗакрытиеМесяцаЗатратыАвто_СПБМ.СтоимостьРейса, 0) КАК СтоимостьРейсаРММСПБ,
	|	ЕСТЬNULL(экЗакрытиеМесяцаЗатратыАвто_МСКБ.СтоимостьРейса, 0) КАК СтоимостьРейсаРБММСК,
	|	ЕСТЬNULL(экЗакрытиеМесяцаЗатратыАвто_СПББ.СтоимостьРейса, 0) КАК СтоимостьРейсаРБМСПБ,
	|	ЕСТЬNULL(экЗакрытиеМесяцаЗатратыАвто_МСКЗ.СтоимостьРейса, 0) КАК СтоимостьРейсаРЗММСК,
	|	ЕСТЬNULL(экЗакрытиеМесяцаЗатратыАвто_СПБЗ.СтоимостьРейса, 0) КАК СтоимостьРейсаРЗМСПБ,
	|	ЕСТЬNULL(ЕСТЬNULL(ВЗ_ЗакрытиеМесяца.ЗакрытиеМСК.ПроцентЗатратНаОперацииТерминал, ВЗ_ЗакрытиеМесяца.ЗакрытиеСПБ.ПроцентЗатратНаОперацииТерминал), 0) КАК ПроцентЗатратНаОперацииТерминал
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИСТИНА КАК Поле1) КАК ВЗ_Связь
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА экЗакрытиеМесяца.Регион = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
	|						ТОГДА экЗакрытиеМесяца.Ссылка
	|				КОНЕЦ) КАК ЗакрытиеМСК,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА экЗакрытиеМесяца.Регион = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.СПбСтриж)
	|						ТОГДА экЗакрытиеМесяца.Ссылка
	|				КОНЕЦ) КАК ЗакрытиеСПБ
	|		ИЗ
	|			Документ.экЗакрытиеМесяца КАК экЗакрытиеМесяца
	|		ГДЕ
	|			экЗакрытиеМесяца.ПериодРасчета = &ПериодРасчета
	|			И экЗакрытиеМесяца.Проведен) КАК ВЗ_ЗакрытиеМесяца
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.экЗакрытиеМесяца.ЗатратыАвто КАК экЗакрытиеМесяцаЗатратыАвто_МСКМ
	|			ПО ВЗ_ЗакрытиеМесяца.ЗакрытиеМСК = экЗакрытиеМесяцаЗатратыАвто_МСКМ.Ссылка
	|				И (экЗакрытиеМесяцаЗатратыАвто_МСКМ.ФорматАвтотранспорта = ЗНАЧЕНИЕ(Справочник.ФорматыАвтотранспорта.МалоеАвто))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.экЗакрытиеМесяца.ЗатратыАвто КАК экЗакрытиеМесяцаЗатратыАвто_МСКБ
	|			ПО ВЗ_ЗакрытиеМесяца.ЗакрытиеМСК = экЗакрытиеМесяцаЗатратыАвто_МСКБ.Ссылка
	|				И (экЗакрытиеМесяцаЗатратыАвто_МСКБ.ФорматАвтотранспорта = ЗНАЧЕНИЕ(Справочник.ФорматыАвтотранспорта.БольшоеАвто))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.экЗакрытиеМесяца.ЗатратыАвто КАК экЗакрытиеМесяцаЗатратыАвто_МСКЗ
	|			ПО ВЗ_ЗакрытиеМесяца.ЗакрытиеМСК = экЗакрытиеМесяцаЗатратыАвто_МСКЗ.Ссылка
	|				И (экЗакрытиеМесяцаЗатратыАвто_МСКЗ.ФорматАвтотранспорта = ЗНАЧЕНИЕ(Справочник.ФорматыАвтотранспорта.ЗаборноеАвто))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.экЗакрытиеМесяца.ЗатратыАвто КАК экЗакрытиеМесяцаЗатратыАвто_СПБМ
	|			ПО ВЗ_ЗакрытиеМесяца.ЗакрытиеСПБ = экЗакрытиеМесяцаЗатратыАвто_СПБМ.Ссылка
	|				И (экЗакрытиеМесяцаЗатратыАвто_СПБМ.ФорматАвтотранспорта = ЗНАЧЕНИЕ(Справочник.ФорматыАвтотранспорта.МалоеАвто))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.экЗакрытиеМесяца.ЗатратыАвто КАК экЗакрытиеМесяцаЗатратыАвто_СПББ
	|			ПО ВЗ_ЗакрытиеМесяца.ЗакрытиеСПБ = экЗакрытиеМесяцаЗатратыАвто_СПББ.Ссылка
	|				И (экЗакрытиеМесяцаЗатратыАвто_СПББ.ФорматАвтотранспорта = ЗНАЧЕНИЕ(Справочник.ФорматыАвтотранспорта.БольшоеАвто))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.экЗакрытиеМесяца.ЗатратыАвто КАК экЗакрытиеМесяцаЗатратыАвто_СПБЗ
	|			ПО ВЗ_ЗакрытиеМесяца.ЗакрытиеСПБ = экЗакрытиеМесяцаЗатратыАвто_СПБЗ.Ссылка
	|				И (экЗакрытиеМесяцаЗатратыАвто_СПБЗ.ФорматАвтотранспорта = ЗНАЧЕНИЕ(Справочник.ФорматыАвтотранспорта.ЗаборноеАвто))
	|		ПО (ИСТИНА)";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Для Каждого Колонка Из Результат.Колонки Цикл
		ИмяКолонки = Колонка.Имя;
		
		ТекПараметр = ЭлементыПараметров.Найти(ИмяКолонки);
		ТекПараметр.Значение = Выборка[ИмяКолонки];
		ТекПараметр.Использование = Истина;
	КонецЦикла;
	
	ТекПараметр = ЭлементыПараметров.Найти("ДатаВремяФормированияОтчета");
	ТекПараметр.Значение = ТекущаяДата();
	ТекПараметр.Использование = Истина;
	
	//ВнешниеНаборыДанных = ПолучитьВнешниеНаборыДанных(СтандартныйПериод.ДатаНачала, СтандартныйПериод.ДатаОкончания, Контрагент);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновщика, ДанныеРасшифровки);

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	КоличествоУровней = ДокументРезультат.КоличествоУровнейГруппировокСтрок();
	Для Уровень = 1 По КоличествоУровней Цикл
	    ДокументРезультат.ПоказатьУровеньГруппировокСтрок(КоличествоУровней - Уровень);
	КонецЦикла;

	//ДокументРезультат.ПоказатьУровеньГруппировокСтрок(2); //Уровень 3
    //ДокументРезультат.ПоказатьУровеньГруппировокСтрок(1); //Уровень 2
	//ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);   //Уровень 1
	
	//фиксация сверху
	НомерСтрокиЗаказ = Мин(20, ДокументРезультат.ВысотаТаблицы);
	Для НомерСтроки = 1 По НомерСтрокиЗаказ Цикл
		ТекОбласть = ДокументРезультат.Область(НомерСтроки, 1, НомерСтроки, 1);
		Если ТекОбласть.Текст = "Заказ" Тогда
			ДокументРезультат.ФиксацияСверху = НомерСтроки;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	//фиксация слева
	ДокументРезультат.ФиксацияСлева = 6;
	
КонецПроцедуры
